In [1]:
import pandas as pd

In [2]:
salaries = pd.read_csv('Salaries.csv')

C:\Users\umair\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3049: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df = pd.DataFrame(data = salaries)

In [4]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148049 non-null object
OvertimePay         148654 non-null object
OtherPay            148654 non-null object
Benefits            112495 non-null object
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              38119 non-null object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [84]:
df['Notes'].head()

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: Notes, dtype: float64

In [125]:
# average values of col 'BasePay'
# df['BasePay']

# def eliminate_strings(col_value):
    
 #    int_float_list = []
    
    # if not col_value == str(col_value):
    #   int_float_list.append(col_value)
        
   #  return int_float_list

In [126]:
# BasePay = df['BasePay'].apply(eliminate_strings)

In [127]:
df['BasePay'].head().mean()

149686.786

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148049 non-null object
OvertimePay         148654 non-null object
OtherPay            148654 non-null object
Benefits            112495 non-null object
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              38119 non-null object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [87]:
# finding JobTitle for person 'JOSEPH DRISCOLL'
df[df['EmployeeName'] == 'JOSEPH DRISCOLL'] # reports back DataFrame where, col 'EmployeeName' = 'JOSEPH DRISCOLL'

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140547,97868.8,31909.3,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

In [131]:
df[df['EmployeeName'] == 'PATRICK GARDNER']  # reports back the DataFrame where col 'EmployeeName' = 'PATRICK GARDNER'

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [134]:
# now lets check out the col 'OvertimePay' against col 'EmployeeName' entry 'PATRICK GARDNER'

df[df['EmployeeName'] == 'PATRICK GARDNER']['OvertimePay']

4    9737
Name: OvertimePay, dtype: object

In [90]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['OvertimePay']

# reports back col 'OvertimePay' of a DataFrame where col 'EmployeeName' = 'JOSEPH DRISCOLL'

24    97868.8
Name: OvertimePay, dtype: object

In [91]:
# similarly if we want to find out col 'JobTitle' where col 'EmployeeName' = 'JOSEPH DRISCOLL'
# we can do the following.

df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [93]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [95]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()] # reports back DataFrame where, col 'TotalPayBenefits' = col 'TotalPayBenefits'.max()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [135]:
# maximum salary person example#2

df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [136]:
# lets now grab the name and jobtitle of that person having maximum salary

name = df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]['EmployeeName']

In [138]:
name

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [139]:
# now for the jobtitle we have

jobtitle = df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]['JobTitle']

In [140]:
jobtitle

0    GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
Name: JobTitle, dtype: object

In [97]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [98]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [118]:
df[df['EmployeeName'] == 'JOSEPH DRISCOLL'] # report back the DataFrame where, col 'EmployeeName' = 'JOSEPH DRISCOLL'

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140547,97868.8,31909.3,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

In [119]:
df[df['JobTitle'] == 'GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY'] # reports back the DataFrame where col 'JobTitle' = 'GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY'

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
83,84,EDWARD REISKIN,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,230827,0,0,NaN,230827.12,230827.12,2011,NaN,San Francisco,NaN

In [120]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

In [122]:
df['TotalPayBenefits'].argmax()

# reports back index value where col 'TotalPayBenefits' = maximum

C:\Users\umair\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  """Entry point for launching an IPython kernel.

0

In [124]:
df.loc[0]['EmployeeName'] # reports back the entry in col 'EmployeeName', where index location = 0

'NATHANIEL FORD'

In [126]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]['EmployeeName'] # reports back the entry in col 'EmployeeName' where col

# 'TotalPayBenefits' has minimum value

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [142]:
# lets break the above piece of code into chunks

# stpes:
 #- grab the DataFrame where col 'TotalPayBenefits' has minimum value
 #- grab the name entry in col 'EmployeeName'
 #- grab the jobtitle entry in col 'JobTitle'

df[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [144]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]['EmployeeName'] # reports back the col EmployeeName entry

148653    Joe Lopez
Name: EmployeeName, dtype: object

In [146]:
df[df['TotalPayBenefits'] == df['TotalPayBenefits'].min()]['JobTitle'] # reports back the col 'JobTitle' entry

148653    Counselor, Log Cabin Ranch
Name: JobTitle, dtype: object

In [130]:
# another way we can find this is
# to find the index where the 'TotalPayBenefits' col has minimum value

df['TotalPayBenefits'].argmin()

C:\Users\umair\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning:
The current behaviour of 'Series.argmin' is deprecated, use 'idxmin'
instead.
The behavior of 'argmin' will be corrected to return the positional
minimum in the future. For now, use 'series.values.argmin' or
'np.argmin(np.array(values))' to get the position of the minimum
row.
  after removing the cwd from sys.path.

148653

In [132]:
df.loc[148653]['EmployeeName']

'Joe Lopez'

In [148]:
df[df['Year'] == 2011]['BasePay'].mean()  # reports back the the mean of col 'BasePay' in year 2011

63595.956516774524

In [147]:
df[df['Year'] == 2012]['BasePay'].mean()  # reports back the mean of col 'BasePay' in year 2012

65436.40685742255

In [152]:
df[df['Year'] == 2013]['BasePay'].mean() # 2012

69630.0302164812

In [150]:
df[df['Year'] == 2014].head()['BasePay'].mean() # 2013

262968.708

In [160]:
df.groupby('Year').mean()['TotalPay'] # reports back the mean values of col 'TotalPay' with respect to each year

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

In [155]:
# lets disect above piece of code a bit more

# groupby method groups rows together taking column values in account

df.groupby('Year').head() # returns the DataFrame grouped by col 'Year'

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
36159,36160,Gary Altenberg,"Lieutenant, Fire Suppression",128809,220909,13126.3,44430.1,362844.66,407274.78,2012,NaN,San Francisco,NaN
36160,36161,Gregory Suhr,Chief of Police,302578,0,18974.1,69810.2,321552.11,391362.30,2012,NaN,San Francisco,NaN
36161,36162,Khoa Trinh,Electronic Maintenance Tech,111921,146415,78057.4,53102.3,336393.73,389496.02,2012,NaN,San Francisco,NaN
36162,36163,Joanne Hayes-White,"Chief, Fire Department",296943,0,17816.6,72047.9,314759.60,386807.48,2012,NaN,San Francisco,NaN
36163,36164,Frederick Binkley,EMT/Paramedic/Firefighter,126863,192424,17917.2,44438.2,337204.86,381643.11,2012,NaN,San Francisco,NaN
72925,72926,Gregory P Suhr,Chief of Police,319275,0,20007.1,86533.2,339282.07,425815.28,2013,NaN,San Francisco,NaN
72926,72927,Joanne M Hayes-White,"Chief, Fire Department",313686,0,23236,85431.4,336922.01,422353.40,2013,NaN,San Francisco,NaN
72927,72928,Samson Lai,"Battalion Chief, Fire Suppress",186236,131218,29648.3,57064.9,347102.32,404167.27,2013,NaN,San Francisco,NaN
72928,72929,Ellen G Moffatt,Asst Med Examiner,272856,23727.9,38954.5,66198.9,335537.96,401736.88,2013,NaN,San Francisco,NaN
72929,72930,Robert L Shaw,"Dep Dir for Investments, Ret",315572,0,0,82849.7,315572.01,398421.67,2013,NaN,San Francisco,NaN
110531,110532,David Shinn,Deputy Chief 3,129150,0,342803,38780,471952.64,510732.68,2014,NaN,San Francisco,PT
110532,110533,Amy P Hart,Asst Med Examiner,318835,10713,60563.5,89540.2,390111.98,479652.21,2014,NaN,San Francisco,FT
110533,110534,William J Coaker Jr.,Chief Investment Officer,257340,0,82313.7,96570.7,339653.70,436224.36,2014,NaN,San Francisco,PT
110534,110535,Gregory P Suhr,Chief of Police,307450,0,19266.7,91302.5,326716.76,418019.22,2014,NaN,San Francisco,FT
110535,110536,Joanne M Hayes-White,"Chief, Fire Department",302068,0,24165.4,91201.7,326233.44,417435.10,2014,NaN,San Francisco,FT

In [157]:
df.groupby('Year').mean().head() # returns thd DataFrame having mean values for each column

            Id      TotalPay  TotalPayBenefits  Notes
Year
2011   18080.0  71744.103871      71744.103871    NaN
2012   54542.5  74113.262265     100553.229232    NaN
2013   91728.5  77611.443142     101440.519714    NaN
2014  129593.0  75463.918140     100250.918884    NaN

In [161]:
df.groupby('Year').mean()['TotalPay'] # reports back the entries of col 'TotalPay' grouped by col 'Year' with mean values

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

In [162]:
df['JobTitle'].nunique()  # no of unique JobTitles

2159

In [168]:
df['JobTitle'].value_counts().head(5)  # reports back top 5 most common entries of col 'JobTile'

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [188]:
df['EmployeeName'].value_counts() == 1

Kevin Lee                  False
William Wong               False
Richard Lee                False
Steven Lee                 False
Michael Wong               False
John Chan                  False
Stanley Lee                False
KEVIN LEE                  False
William Lee                False
Victor Lee                 False
MICHAEL LEE                False
David Wong                 False
DAVID WONG                 False
RICHARD LEE                False
John Miller                False
MICHAEL BROWN              False
Sandy Wong                 False
Michael Lee                False
Amelie E Bullard           False
STANLEY LEE                False
WILLIAM WONG               False
STEVEN LEE                 False
Michael A Johnson          False
Michael Brown              False
Douglas R Price-Hanson     False
Thomas Smith               False
Emelita M Hathaway         False
Georgia H Chourre          False
Evelyn M Palomares         False
Vincent Wong               False
                           ...
ZAKARIA SIMMA               True
Laura R Epstein-Norris      True
Joey Manalisay              True
Sharon S Young              True
Frederick Huang             True
Christopher L Ochoa         True
LEONARD PERALTA             True
DENNY LEE                   True
ANDREA SERRANO              True
Audrey Park                 True
Tyrone Simon                True
REGINALD SPENCER            True
Rhonda Banks                True
David Loustalot             True
Randall Dea                 True
EILEEN ODELL                True
Robert Kelley               True
JOHN PRETE                  True
Margarita Gonzalez-Diaz     True
TYRENE LABUTAN              True
Alric Khin Kyu Koung        True
KELVIN GODSHALL             True
Mary Burns                  True
Huiyan (Jenny) Yuan         True
JOYCE LANE                  True
Loranta Louie               True
Mathew  Snyder              True
James Drilon                True
Kenneth B Mccormick         True
Beaulah Smith               True
Name: EmployeeName, Length: 110811, dtype: bool

In [12]:
df['JobTitle'].value_counts().head(10) # reports back top ten most common entries of col 'JobTitle'f

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Custodian                       2418
TRANSIT OPERATOR                2388
Firefighter                     2359
Recreation Leader               1971
Patient Care Assistant          1945
Name: JobTitle, dtype: int64

In [184]:
sum(df[df['Year'] == 2013]['JobTitle'].value_counts() == 1)

# reports back total number of entries in col 'JobTitle' who have only one accuracne in Year '2013' in col 'Year'

202

In [189]:
sum(df[df['Year'] == 2011]['JobTitle'].value_counts() == 1)

200

In [191]:
# for year 2012

sum(df[df['Year'] == 2012]['JobTitle'].value_counts() == 1)

190

In [193]:
# lets figure out the valu_counts of col 'EmployeeName' per year

sum(df[df['Year'] == 2011]['EmployeeName'].value_counts() == 1)

31888

In [198]:
sum(df[df['Year'] == 2012]['EmployeeName'].value_counts() == 3) # returns the sum of value_counts of col 'EmployeeName'

# where col 'Year' = 2012

154

In [26]:
sum(df[df['Year'] == 2014]['JobTitle'].value_counts() == 1)

# reports back the value counts of the col 'JobTitle' where value equals '1' for the col 'Year' = 2014

175

In [34]:
len(df[df['JobTitle'] == 'Special Nurse']['JobTitle']) # reports back the number of entries

# in col 'JobTitle' where 'JobTitle' = "Special Nurse"

4389

In [201]:
len(df[df['JobTitle'] == 'Special Nurse']['JobTitle']) # reports back the length of col 'JobTitle' where
# col 'JobTitle' = 'Special Nurse'

4389

In [202]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [40]:
# df[df['Year'] == 2014]['JobTitle']

# df[df['W'] == 1]['Y']

df.loc[110531]  # reports back the row on particular ID

Id                          110532
EmployeeName           David Shinn
JobTitle            Deputy Chief 3
BasePay                     129150
OvertimePay                      0
OtherPay                    342803
Benefits                     38780
TotalPay                    471953
TotalPayBenefits            510733
Year                          2014
Notes                          NaN
Agency               San Francisco
Status                          PT
Name: 110531, dtype: object

In [56]:
# how many people have word Chief in their names?

def chief_string(title):
    if 'chief' in title.lower():
        return True
    return False

In [43]:
chief('hey its umair here')

False

In [44]:
chief('hey! its chief umair here')

True

In [63]:
# now in order to find the total number of values in col 'JobTitle' that have the word 'chief' in them
# we need to apply this method on our 'JobTitle' DataFrame
# and then sum all the values to get the total value

sum(df['JobTitle'].apply(chief))  # it will report back the sum of all those entries that have the word 'chief' in them

627

In [65]:
sum(df['JobTitle'].apply(lambda x: chief_string(x)))

627